Revit 2027 API
ParameterTypeId.FamilyEnableCuttingInViews Property
 "Enable Cutting in Views"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId FamilyEnableCuttingInViews { get; }
Public Shared ReadOnly Property FamilyEnableCuttingInViews As ForgeTypeId
	Get
public:
static property ForgeTypeId^ FamilyEnableCuttingInViews {
	ForgeTypeId^ get ();
}
static member FamilyEnableCuttingInViews : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace